/*
Представьте, что один из пользователей сервиса сделал заказ, 
в который вошли одна пачка сухариков, одна пачка чипсов и один энергетический напиток. 
Посчитайте стоимость такого заказа.

Колонку с рассчитанной стоимостью заказа назовите order_price.

Для расчётов используйте таблицу products.

Поле в результирующей таблице: order_price
*/

-- Мое решение
SELECT sum(price) as order_price
FROM   products
WHERE  name in ('сухарики', 'чипсы', 'энергетический напиток');

-- Правильное решение
SELECT sum(price) as order_price
FROM   products
WHERE  name in ('сухарики', 'чипсы', 'энергетический напиток')